tianshu0/esp32-node/sdkconfig.defaults
# esp32-node 默认配置（目标芯片 ESP32-C3 / 4MB Flash / NimBLE Peripheral）
# 固定目标芯片，避免换机器构建时误用 esp32 默认目标
CONFIG_IDF_TARGET="esp32c3"

# 增大主任务栈，容纳 C++ 组件初始化（NimBLE + 组件装配）
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# 自定义分区表（4MB 方案，见 partitions.csv）
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# Flash 大小：4MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# BLE：使用 NimBLE 协议栈，本设备只做 Peripheral（等 hub 主动连接）
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
# 单连接：一个节点同时只服务一个 hub
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# ATT MTU 提到 512：握手 hello_ack 带完整能力清单（types+各传感器 format，
# 约 290 字节），默认 256 时单包 payload 上限 253，NimBLE 会静默截断 JSON。
# 与 hub 协商取双方最小值，两边必须同时 >=512。
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512

# 低功耗：电源管理 + tickless idle（运行时由 app_config.power_save 开关控制，
# 默认关闭，仅电池供电场景启用）
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# ============ 显示（默认 SSD1315 128x64 单色 OLED，LVGL 9 + esp_lvgl_port）============
# 屏/传感器/板型为编译期选择，见 main/Kconfig.projbuild（idf.py menuconfig
# -> Node hardware profile）。选 NODE_DISPLAY_NONE 时显示源文件不编入（LVGL 仍构建）。
# LVGL 用内置内存池（LV_USE_BUILTIN_MALLOC），lv_init() 一次性向堆申请 LV_MEM_SIZE。
# 节点 UI 只有一屏约 10 个对象，16KB 足够（默认 64KB 对 C3 的 188KB 堆太大）。
CONFIG_LV_MEM_SIZE_KILOBYTES=16

# 布局用到的字号：页眉 10，标签 12，数值 14（14 为 LVGL 默认字体，显式固定）
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y

# ============ 板型 / 传感器 / 显示屏（编译期正交选择）============
# 如需修改，运行 idf.py menuconfig -> Node hardware profile，或直接改这里。
# 板型：ESP32-C3 + I2C 传感器组 + OLED
CONFIG_NODE_BOARD_C3_I2C_OLED=y
# 传感器：默认启用 21VOC（UART 五合一空气质量），SHT3X/BMP180 按需开启
# CONFIG_NODE_SENSOR_SHT3X is not set
# CONFIG_NODE_SENSOR_BMP180 is not set
CONFIG_NODE_SENSOR_VOC21=y
# 显示屏：0.91" SSD1306 128x32（如需 0.96" SSD1315 128x64 改为 NODE_DISPLAY_SSD1315）
# CONFIG_NODE_DISPLAY_SSD1315 is not set
CONFIG_NODE_DISPLAY_SSD1306_128X32=y
# CONFIG_NODE_DISPLAY_NONE is not set
